battery.org
#+title: Battery Emacs theme

* main package

#+begin_src elisp :tangle battery.el :noweb yes
;;; battery.el --- Warm and vibrant color scheme for Emacs -*- lexical-binding: t; -*-
;;
; Copyright (C) 2022 Guilherme Machado
;;
;; Author: Guilherme Machado <https://github.com/goiabae>
;; Maintainer: Guilherme Machado <goiabae@protonmail.com>
;; Created: 02 Feb 2022
;; Version: 0.0.2
;; Homepage: https://github.com/goiabae/emacs-theme-battery
;; Package-Requires: ((autothemer "0.2") (dash))
;;
;; This file is not part of GNU Emacs.
;;
;;; Commentary:

;;  Template for a warm and vibrant color scheme inspired by the famous
;;  Gruvbox, from Vim.

;;; Code:

(require 'autothemer)

(defmacro battery-deftheme (name description is-light)
  `(autothemer-deftheme
    ,name
    ,description
    ,(append
      '((((class color)
          (min-colors #xFFFFFF)))

        (neutral0  "#101010")
        (neutral1  "#191919")
        (neutral2  "#262524")
        (neutral3  "#353231")
        (neutral4  "#403c3a")
        (neutral5  "#504845")
        (neutral6  "#635852")
        (neutral7  "#7b6c61")
        (neutral8  "#958172")
        (neutral9  "#a89984")
        (neutral10 "#bdae93")
        (neutral11 "#d2c3a5")
        (neutral12 "#e7d8b3")
        (neutral13 "#f2e4ba")
        (neutral14 "#faedc9")
        (neutral15 "#fef5d8"))

      (let ((symbols
             (mapcar
              (lambda (n)
                (mapcar
                 (lambda (i) (intern (concat n (number-to-string i))))
                 (-iota 16)))
              (list "grey" "neutral"))))
        (-zip-with #'list
                   (car symbols)
                   (if is-light (reverse (cadr symbols)) (cadr symbols))))

      '((bg grey1)
        (fg grey13)

        (darker-red      "#67191b")
        (darker-orange   "#572e1a")
        (darker-yellow   "#423818")
        (darker-olive    "#302f16")
        (darker-green    "#183815")
        (darker-cyan     "#1a2d1e")
        (darker-purple   "#462929")

        (dark-red        "#be241e")
        (dark-orange     "#ac4003")
        (dark-yellow     "#a57109")
        (dark-olive      "#746f06")
        (dark-green      "#24601c")
        (dark-cyan       "#2b5434")
        (dark-purple     "#a63445")

        (red             "#e83437")
        (orange          "#d6580e")
        (yellow          "#d09420")
        (olive           "#98952a")
        (green           "#3f9f32")
        (cyan            "#689e69")
        (purple          "#b16262")

        (light-red       "#fc5356")
        (light-orange    "#fc823c")
        (light-yellow    "#fac240")
        (light-olive     "#b5ba25")
        (light-green     "#5ac04e")
        (light-cyan      "#8ec07c")
        (light-purple    "#ed8585")

        (lighter-red     "#fca39c")
        (lighter-orange  "#fca765")
        (lighter-yellow  "#edd76d")
        (lighter-olive   "#dfe26c")
        (lighter-green   "#a2ea98")
        (lighter-cyan    "#aed8a0")
        (lighter-purple  "#f7b4b4"))

      (let ((colors '(red orange yellow olive green cyan purple))
            (abs-shades '(darker dark light lighter))
            (rel-shades '(lower low high higher)))
        (let ((rel-colors
               (mapcar (lambda (x) (mapcar (lambda (y) (intern (concat (symbol-name x) "-" (symbol-name y)))) colors)) rel-shades))
              (abs-colors
               (mapcar (lambda (x) (mapcar (lambda (y) (intern (concat (symbol-name x) "-" (symbol-name y)))) colors)) abs-shades)))
          (-zip-with #'list
            (-flatten rel-colors)
            (-flatten
              (if is-light (reverse abs-colors) abs-colors))))))

    (
      <<faces>>
     )
    (custom-theme-set-variables
     (quote ,name)
     `(ansi-color-names-vector
       [,red
        ,olive
        ,orange
        ,purple
        ,yellow
        ,green
        ,cyan]))))

(provide 'battery)
;;; battery.el ends here
#+end_src

* light variant

#+begin_src elisp :tangle battery-light-theme.el
;;; battery-light-theme.el --- Warm, dark and vibrant color scheme for Emacs -*- lexical-binding: t; -*-
;;
;; Copyright (C) 2022 Guilherme Machado
;;
;; Author: Guilherme Machado <https://github.com/goiabae>
;; Maintainer: Guilherme Machado <goiabae@protonmail.com>
;; Created: 02 Feb 2022
;; Version: 0.0.2
;; Homepage: https://github.com/goiabae/emacs-theme-battery
;;
;; This file is not part of GNU Emacs.
;;
;;; Commentary:

;;  A warm, light and vibrant color scheme inspired by the famous
;;  Gruvbox, from Vim.

;;; Code:

(require 'battery)

(battery-deftheme battery-light "Warm, light and vibrant colour theme" t)

(provide-theme 'battery-light)
;;; battery-light-theme.el ends here
#+end_src

* dark variant

#+begin_src elisp :tangle battery-dark-theme.el
;;; battery-dark-theme.el --- Warm, dark and vibrant color scheme for Emacs -*- lexical-binding: t; -*-
;;
;; Copyright (C) 2022 Guilherme Machado
;;
;; Author: Guilherme Machado <https://github.com/goiabae>
;; Maintainer: Guilherme Machado <goiabae@protonmail.com>
;; Created: 02 Feb 2022
;; Version: 0.0.2
;; Homepage: https://github.com/goiabae/emacs-theme-battery
;;
;; This file is not part of GNU Emacs.
;;
;;; Commentary:

;;  A warm, dark and vibrant color scheme inspired by the famous
;;  Gruvbox, from Vim.

;;; Code:

(require 'battery)

(battery-deftheme battery-dark "Warm, dark and vibrant colour theme" nil)

(provide-theme 'battery-dark)
;;; battery-dark-theme.el ends here
#+end_src

